{
    "pm04_in_027.wav": "Find the bottle that is on the table to the left of the computer and bring it to the wardrobe that is next to the glass door.\n",
    "pm04_in_033.wav": "Take a soda can to the fridge. You can find one on the table to the left of the blue sofa.\n",
    "pf03_in_008.wav": "go to any trash bin but not the yellow one\n",
    "pf03_in_034.wav": "Hey, can you pick up my bag for me? It is under the table in front of the glass door. Bring it to the cabinet. Actually, you know what? Forget what I asked for and bring that green toy instead. It's at the same place.\n",
    "pf03_in_020.wav": "I need you to go to the sink, then any computer on a table, but before you start that, can you first go to the bookshelf? When you are done with all that, return to the brown box.\n",
    "pm01_in_022.wav": "Avoid any cabinets but go get the mug on the blue sofa and take it to the red one.\n",
    "pf05_in_017.wav": "you can either go as close as you can to the sink or the plant pot but don't go near the yellow rubber\n",
    "pf05_in_003.wav": "There is a cabinet, a television and a tree in this room. I want you to go to the last item I mentioned, then pass by the second item, but don't go close to the face when you are going to the second item.\n",
    "pm02_in_004.wav": "Go to the trash bin. After that, go to the large television. Actually, can you go to the laptop on the table before doing all that?\n",
    "pm02_in_010.wav": "I need you to first go to the table between the pillar and the door with posters, then go to the tree. You know what, ignore the last thing I asked you to... go to. After the first thing, go to the computer next to the green box instead.\n",
    "pm02_in_011.wav": "Go to the red sofa then the blue one next to the cabinet, but first, pass by the bookshelf.\n",
    "pm02_in_005.wav": "Try to go to the tree without going near the trash bin.\n",
    "pf05_in_002.wav": "Find the door with the posters in front of the yellow pillar, then go stand by the tree, but avoid any sofa.\n",
    "pf05_in_016.wav": "I need you to go to the rest sofa but don't go anywhere near the sink.\n",
    "pm01_in_023.wav": "Please get me my plant pot from between the sofa and the sink, bring it to the white cabinet.\n",
    "pf03_in_021.wav": "There are a couple of things in this room. A coffee machine, a robot, a computer and a plant pot. Visit the second item I mentioned, then the first. After that, visit the brown box, then go to the items you haven't visited yet.\n",
    "pf03_in_035.wav": "Go to the sink and take the mug beside the coffee maker. Drop it off at the red sofa.\n",
    "pf03_in_009.wav": "Visit one of the televisions in this room, then go to the fridge to the left of the cabinet.\n",
    "pm04_in_032.wav": "Never pass by a robot, but I need you to bring the bag on the table to the cabinet.\n",
    "pm04_in_026.wav": "Go get my yellow bag and bring it to the table between the yellow pillar and the wooden door with posters next to the whiteboard.\n",
    "pm04_in_030.wav": "I have a white cabinet, a green toy, a bookshelf and a red chair around here somewhere. Take the second item I mentioned from between the first item and the third. Bring it to the cabinet but avoid the last item at all cost.\n",
    "pm04_in_024.wav": "Can you pick up my book from the left side of the television and bring it to me? I am sitting on the couch which is to the right of the door with posters. Make sure to never go near the trash bin while doing all this. It's on the yellow table.\n",
    "pm04_in_018.wav": "Go to the green curtain after the large television, but try not to go near the red sofa.\n",
    "pf03_in_023.wav": "Please get me my plant pot from between the sofa and the sink. Bring it to the white cabinet.\n",
    "pm01_in_035.wav": "Go to the sink and take the mug beside the coffee maker and drop it off at the red sofa.\n",
    "pm01_in_021.wav": "There are a couple of things in this room, a coffee machine, a robot, a computer and a plant pot. Visit the second item I mentioned, then the first, after that visit the brown box, then go to the items you haven't visited yet.\n",
    "pm01_in_009.wav": "Visit one of the televisions in this room, then go to the fridge to the left of the cabinet.\n",
    "pf05_in_014.wav": "go to the cabinet between the blue sofa and the brown box\n",
    "pf05_in_028.wav": "goes the cabinet between the blue sofa and the yellow robot or the cabinet to the left of the blue sofa.\n",
    "pm02_in_013.wav": "Visit these things in the following order, the microwave, then the black chair in front of the yellow robot, then the fridge, but before doing any of this, go to the robot.\n",
    "pm02_in_007.wav": "Go to the television but avoid the tree.\n",
    "pm02_in_006.wav": "Find the yellow trash bin and go to it, then go by the white table. But before doing the first thing, visit where the fridge is. Then after the last thing, stop by the red sofa but avoid the wooden door with posters.\n",
    "pm02_in_012.wav": "Go to the water filter, don't pass by any computer to the left of the red sofa.\n",
    "pf05_in_029.wav": "Go take the green toy that is next to the sofa under the poster and bring it to the bookshelf.\n",
    "pf05_in_015.wav": "I want you to go to the cabinets but don't go near any black chair. Hold on. Actually, can you pass by the white board before doing all that?\n",
    "pf05_in_001.wav": "Go to the red sofa but don't pass by any door. Then go to the computer. The sofa is behind the pillar and on the right side.\n",
    "pm01_in_008.wav": "Good to any charge pin, but not the yellow one.\n",
    "pm01_in_020.wav": "I need you to go to the sink, then any computer on the table but before you start that, can you first go to the bookshelf. When you are done with all that, return to the brown box.\n",
    "pm01_in_034.wav": "Hey, can you pick up my bag for me? It's under the table in front of the glass door. Bring it to the cabinet. Actually, you know what? Forget what I asked for and bring the green toy instead. It's at the same place.\n",
    "pf03_in_022.wav": "avoid any cup nets but go get the mug on the blue sofa and take it to the red one\n",
    "pm04_in_019.wav": "go to the sink then the red sofa then the guitar after that I want you to return to the first thing you visited\n",
    "pm04_in_025.wav": "Bring the green plush toy to the white board in front of it. Watch out for the robot in front of the toy.\n",
    "pm04_in_031.wav": "Hey, I am standing by the white board in front of the bookshelf. Can you bring me the mug from the table to the left of the fridge?\n",
    "pm04_in_009.wav": "Visit one of the televisions in this room, then go to the fridge to the left of the cabinet.\n",
    "pm04_in_035.wav": "Go to the sink and take the mug beside the coffee maker. Drop it off at the red sofa.\n",
    "pm04_in_021.wav": "There are a couple of things in this room, a coffee machine, a robot, a computer and a plant pot. Visit the second item I mentioned, then the first. After that, visit the brown box, then go to the items you haven't visited yet.\n",
    "pf03_in_026.wav": "Go get my yellow bag and bring it to the table between the yellow pillar and the wooden door with posters next to the white board.\n",
    "pf03_in_032.wav": "Never pass by a robot, but I need you to bring the bag on the table to the cabinet.\n",
    "pm01_in_018.wav": "Go to the green curtain after that, the large television, but try not to go near the red sofa.\n",
    "pm01_in_030.wav": "I have a white cabinet, a green toy, a bookshelf and a red chair around here somewhere. Take the second item I mentioned from between the first item and the third, bring it to the cabinet but avoid the last item at all costs.\n",
    "pm01_in_024.wav": "Can you pick up my book from the left side of the television and bring it to me? I am sitting on the couch, which is to the right of the door with posters. Make sure to never go near the trash bin while doing all this. It's on the yellow table.\n",
    "pf05_in_005.wav": "try to go to the tree without going near the trash bin\n",
    "pf05_in_011.wav": "Go to the red sofa, then the blue one next to the cabinet, but first pass by the bookshelf.\n",
    "pm02_in_016.wav": "I need you to go to the red sofa but don't go anywhere near the sink.\n",
    "pm02_in_002.wav": "Find the door with posters in front of the yellow pillar, then go stand by the tree but avoid any sofa.\n",
    "pm02_in_003.wav": "There's a cabinet, a television and a tree in this room. I want you to go to the last item I mentioned and pass by the second item, but don't go close to the first when you are going to the second item.\n",
    "pm02_in_017.wav": "You can either go as close as you can to the plant pot but don't go near the yellow robot.\n",
    "pf05_in_010.wav": "I need you to first go to the table between the pillar and the door with posters, then go to the tree. You know what, ignore the last thing I asked you to go to. After the first thing, go to the computer next to the green box instead.\n",
    "pf05_in_004.wav": "Go to the trash bin. After that, go to the large television. Actually, can you go to the laptop on the table before doing all that?\n",
    "pm01_in_025.wav": "Bring the green plush toy to the white board in front of it, watch out for the robot in front of the toy.\n",
    "pm01_in_031.wav": "Hey, I'm standing next to the white board in front of the bookshelf. Can you bring me the mug from the table to the left of the fridge?\n",
    "pm01_in_019.wav": "Go to the sink, then the red sofa, then the guitar. After that, I want you to return to the first thing you visited.\n",
    "pf03_in_033.wav": "Take a soda can to the fridge. You can find one on the table to the left of the blue sofa.\n",
    "pf03_in_027.wav": "Find the bottle that is on the table to the left of the computer and bring it to the wardrobe that is next to the glass door.\n",
    "pm04_in_020.wav": "I need you to go to the sink, then any computer on a table, but before you start that, can you first go to the bookshelf? When you are done with all that, return to the brown box.\n",
    "pm04_in_034.wav": "Hey, can you pick up my bag for me? It is under the table in front of the glass door. Bring it to the cabinet. Actually, you know what? Forget what I asked for and bring the green toy instead. It's at the same place.\n",
    "pm04_in_008.wav": "Go to any trash bin, but not the yellow one.\n",
    "pm04_in_022.wav": "Avoid any cabinets but go get the mug on the blue sofa and take it to red one.\n",
    "pf03_in_031.wav": "Hey, I'm standing by the white board in front of the bookshelf. Can you bring me the mug from the table to the left of the fridge?\n",
    "pf03_in_025.wav": "Bring the green plush toy to the white board in front of it. Watch out for the robot in front of the toy.\n",
    "pf03_in_019.wav": "Go to the sink then the red sofa then the guitar. After that I want you to return to the first thing you visited.\n",
    "pm01_in_027.wav": "Find the bottle that is on the table to the left of the computer and bring it to the wardrobe that is next to the glass door.\n",
    "pm01_in_033.wav": "Take a soda can to the fridge. You can find one on the table to the left of the blue sofa.\n",
    "pf05_in_012.wav": "Go to water filter. Don't pass by any computer to the left of the red sofa.\n",
    "pf05_in_006.wav": "Find the yellow trash bin and go to it, then go by the white table, but before doing the first thing, visit where the fridge is and then after the last thing, stop by the red sofa but avoid the wooden door with postage.\n",
    "pm02_in_001.wav": "Go to the red sofa, but don't pass by any door, then go to the computer. The sofa is behind the pillar and on the right side.\n",
    "pm02_in_015.wav": "I want you to go to the cabinet, but don't go near any black chair. Hold on, actually, can you pass by the whiteboard before doing all that?\n",
    "pm02_in_029.wav": "Go take the green toy that is next to the sofa under the poster and bring it to the bookshelf.\n",
    "pm02_in_028.wav": "Go to the cabinets between the blue sofa and the yellow robot or the cabinets to the left of the blue sofa.\n",
    "pm02_in_014.wav": "Go to the cabinets between the blue sofa and the brown box.\n",
    "pf05_in_007.wav": "Go to the television but avoid the tree.\n",
    "pf05_in_013.wav": "visit these things in the following order the microwave then the black chair in front of the yellow robot then the fridge but before doing any of this go to the robot\n",
    "pm01_in_032.wav": "I never pass by a robot, but I need you to bring the bag on the table to the cabinet.\n",
    "pm01_in_026.wav": "Go get my yellow bag and bring it to the table between the yellow pillar and the wooden door with posters next to the whiteboard.\n",
    "pf03_in_018.wav": "Go to the green curtain after that, the large television, but try not to go near the red sofa.\n",
    "pf03_in_024.wav": "Can you pick up my book from the left side of the television and bring it to me? I am sitting on the couch which is to the right of the door with posters. Make sure to never go near the trash bin while doing all this. It's on the yellow table.\n",
    "pf03_in_030.wav": "I have a white cabinet, a green toy, a bookshelf and a red chair around here somewhere. Take the second item I mentioned from between the first item and the third. Bring it to the cabinet but avoid the last item at all costs.\n",
    "pm04_in_023.wav": "Please get me my plant pot from between the sofa and the sink, bring it to the white cabinet.\n",
    "pf04_in_018.wav": "Go to the green curtain after the large television, but try not to go near the red sofa.\n",
    "pf04_in_030.wav": "I have a white cabinet, a green toy, a bookshelf and a red chair around here somewhere. Take the second item I mentioned from between the first item and the third. Bring it to the cabinet but avoid the last item at all costs.\n",
    "pf04_in_024.wav": "Can you pick up my book from the left side of the television and bring it to me? I am sitting on the couch which is to the right of the door with the posters. Make sure to never go near the trash bin while doing all this. It is on the yellow table.\n",
    "pm03_in_023.wav": "Please get me my plant pot from between the sofa and the sink and bring it to the white cabinet.\n",
    "pf01_in_009.wav": "Visit one of the televisions in this room, then go to the fridge to the left of the cabinet.\n",
    "pf01_in_035.wav": "Go to the sink and take the mug beside the coffee maker, drop it off at the red sofa.\n",
    "pf01_in_021.wav": "There are a couple of things in this room. A coffee machine, a robot, a computer, and a plant pot. Visit the second item I mentioned, then the first. After that, visit the brown box, then go to the items you haven't visited.\n",
    "pm05_in_028.wav": "Go to the cabinet between the blue sofa and the yellow robot, or the cabinet to the left of the blue sofa.\n",
    "pm05_in_014.wav": "Go to the cabinets between the blue sofa and the brown box.\n",
    "pf02_in_013.wav": "This is these things in the following order, the microwave, then the black chair in front of a yellow robot, then the fridge, but before doing any of this, go to the robot.\n",
    "pf02_in_007.wav": "Go to the television but avoid the tree.\n",
    "pf02_in_006.wav": "Find the yellow trash bin and go to it. Then go by the white table. But before doing the first thing, visit where the fridge is. Then after the last thing, stop by the red sofa but avoid the wooden door with posters.\n",
    "pf02_in_012.wav": "Go to the water filter. Don't pass by any computer to the left of a red sofa.\n",
    "pm05_in_015.wav": "I want you to go to the cabinet, but don't go near any black chair. Hold on. Actually, can you pass by the white board before doing all that?\n",
    "pm05_in_001.wav": "Go to the red sofa, but don't pass by any door. Then go to the computer. The sofa is behind the pillar and on the right side.\n",
    "pm05_in_029.wav": "Go take the green toy that is next to the sofa under the poster and bring it to the bookshelf.\n",
    "pf01_in_020.wav": "I need you to go to the sink then any computer on a table but before you start that can you go first to the bookshelf? When you are done with all that return to the brown box.\n",
    "pf01_in_034.wav": "Hey, can you pick up my bag for me? It is under the table in front of the glass door. Bring it to the cabinet. Actually, you know what, forget what I asked for and bring the green toy instead. It's at the same place.\n",
    "pf01_in_008.wav": "Go to any trash bin, but not the yellow one.\n",
    "pm03_in_022.wav": "Avoid any cabinet but go get the mug on the blue sofa and take it to the red one.\n",
    "pf04_in_025.wav": "Bring the green plush toy to the white board in front of it. Watch out for the robots in front of the toy.\n",
    "pf04_in_031.wav": "Hey, I am standing by the whiteboard in front of the bookshelf. Can you bring me the mug from the table to the left of the fridge?\n",
    "pf04_in_019.wav": "Go to the sink, then the red sofa, then the guitar. After that I want you to return to the first thing you visited.\n",
    "pf04_in_027.wav": "Find the bottle that is on the table to the left of the computer and bring it to the wardrobe that is next to the glass door.\n",
    "pf04_in_033.wav": "Take a soda mug to the fridge. You can find one on the table to the left of the blue sofa.\n",
    "pm03_in_034.wav": "Hey, can you pick up my bag for me? It is under the table in front of the glass door, bring it to the cabinet. Actually, you know what, forget what I asked for and bring the green toy instead. It's at the same place.\n",
    "pm03_in_020.wav": "I need you to go to the sink then any computer on the table but before you start that can you first go to the bookshelf when you're done with all that return to the brown box\n",
    "pm03_in_008.wav": "Go to any trash bin, but not the yellow one.\n",
    "pf01_in_022.wav": "Avoid any cabinets but go get the mug on the blue sofa and take it to the red one.\n",
    "pm05_in_017.wav": "You can either go as close as you can to the sink or the plant pot, but don't go near the yellow robot.\n",
    "pm05_in_003.wav": "There is a cabinet, a television and a tree in this room. I want you to go to the last item I mentioned, then pass by the second item, but don't go close to the first when you are going to the second item.\n",
    "pf02_in_004.wav": "Go to the trash bin. After that, go to the large television. Actually, can you go to the laptop on the table before doing all that?\n",
    "pf02_in_010.wav": "I need you to first go to the table between the pillar and the door with posters, then go to the tree. You know what? Ignore the last thing I asked you to do. After the first thing, go to the computer next to the green box instead.\n",
    "pf02_in_011.wav": "Go to the red sofa, then the blue one next to the cabinets, but first pass by the bookshelf.\n",
    "pf02_in_005.wav": "Try to go to the tree without going near the trash bin.\n",
    "pm05_in_002.wav": "Find the door with posters in front of the yellow pillar, then go stand by the tree but avoid any sofa.\n",
    "pm05_in_016.wav": "I need you to go to the red sofa but don't go anywhere near the sink.\n",
    "pf01_in_023.wav": "Please get me my plant pot from between the sofa and the sink. Bring it to the white cabinet.\n",
    "pm03_in_009.wav": "Visit one of the televisions in this room, then go to the fridge to the left of the cabinet.\n",
    "pm03_in_021.wav": "There are a couple of things in this room, a coffee machine, a robot, a computer and a plant pot. Visit the second item I mentioned, then the first, after that visit the brown box, then go to the items you haven't visited yet.\n",
    "pm03_in_035.wav": "Go back to the sink and take the mug beside the coffee maker. Drop it off at the red sofa.\n",
    "pf04_in_032.wav": "Never pass by a robot, but I need you to bring the bag on the table to the cabinet.\n",
    "pf04_in_026.wav": "Go get my yellow bag and bring it to the table between the yellow pillar and the wooden door with the posters next to the white board.\n",
    "pf04_in_022.wav": "Avoid any cabinets, but go get the mug on the blue sofa and take it to the red one.\n",
    "pm03_in_019.wav": "Go to the sink, then the red sofa, then the guitar. After that, I want you to return to the first thing that you visited.\n",
    "pm03_in_031.wav": "Hey, I'm standing by the whiteboard in front of the bookshelf. Can you bring me the mug from the table to the left of the fridge?\n",
    "pm03_in_025.wav": "Bring the green plush toy to the white board in front of it, watch out for the robot in front of the toy.\n",
    "pf01_in_027.wav": "Find the bottle that is on the table to the left of the computer and bring it to the wardrobe that is next to the glass door.\n",
    "pf01_in_033.wav": "Take a soda can to the fridge. You can find one on the table to the left of the blue sofa.\n",
    "pm05_in_012.wav": "Go to water filter. Don't pass by any computer to the left of the red sofa.\n",
    "pm05_in_006.wav": "Find the yellow trash bin and go to it then go by the white table but before doing the first thing visit where the fridge is then after the last thing stop by the red sofa but avoid the wooden door with posters\n",
    "pf02_in_029.wav": "Go take the green toy that is next to the sofa under the poster and bring it to the bookshelf.\n",
    "pf02_in_001.wav": "Go to the red sofa but don't pass by any door then go to the computer. The sofa is behind the pillar and on the right side.\n",
    "pf02_in_015.wav": "I want you to go to the cabinet but don't go near any black chair. Hold on. Actually, can you pass by the white board before doing all that?\n",
    "pf02_in_014.wav": "Go to the cup nest between the blue sofa and the brown box\n",
    "pf02_in_028.wav": "Go to the cabinet between the blue sofa and the yellow robots or the cabinet to the left of the blue sofa\n",
    "pm05_in_007.wav": "Go to the television, but avoid the tree.\n",
    "pm05_in_013.wav": "Visit these things in the following order the microwave then the black chair in front of the yellow robots then the fridge but before doing any of these go to the robots\n",
    "pf01_in_032.wav": "Never pass by a robot, but I need you to bring the bag on the table to the cabinet.\n",
    "pf01_in_026.wav": "Go get my yellow bag and bring it to the table between the yellow pillar and the wooden door with posters next to the white board.\n",
    "pm03_in_024.wav": "Can you pick up my book from the left side of the television and bring it to me? I am sitting on the couch which is to the right of the door with posters. Make sure you never go near the trash bin while doing all this. It is on the yellow table.\n",
    "pm03_in_030.wav": "I have a white cabinet, a green toy, a bookshelf and a red chair around here somewhere. Take the second item I mentioned from between the first item and the third. Bring it to the cabinet but avoid the last item at all costs.\n",
    "pm03_in_018.wav": "Go to the green curtain, after that the large television, but try not to go near the red sofa.\n",
    "pf04_in_023.wav": "Please get me the plant pot from between the sofa and the sink. Bring it to the white cabinet.\n",
    "pf04_in_035.wav": "Go to the sink and take the mug beside the coffee maker. Drop it off at the red sofa.\n",
    "pf04_in_021.wav": "There are a couple of things in this room. A coffee machine, a robot, a computer and a plant pot. Visit the second item I mentioned, then the first. After that, visit the brown box, then go to the items you haven't visited yet.\n",
    "pf04_in_009.wav": "Visit one of the televisions in this room, then go to the fridge to the left of the cabinet.\n",
    "pm03_in_026.wav": "Go get my yellow bag and bring it to the table between the yellow pillar and the wooden door with the posters next to the white wood.\n",
    "pm03_in_032.wav": "Never pass by a robot, but I need you to bring the bag on the table to the cabinet.\n",
    "pf01_in_030.wav": "I have a white cabinet, a green toy, a bookshelf and a red chair around here somewhere. Take the second item I mentioned from between the first item and the third. Bring it to the cabinet but avoid the last item at all costs.\n",
    "pf01_in_024.wav": "Can you pick up my book from the left side of the television and bring it to me? I am sitting on the couch which is to the right of the door with posters. Make sure to never go near the trash bin while doing all this. It is on the yellow table.\n",
    "pf01_in_018.wav": "Go to the green curtain after that, the large television, but try not to go near the red sofa.\n",
    "pm05_in_005.wav": "Try to go to the tree without going near the trash bin.\n",
    "pm05_in_011.wav": "Go to the red sofa, then the blue one next to the cabinets, but first pass by the bookshelf.\n",
    "pf02_in_016.wav": "I need you to go to the red sofa but don't go anywhere near the sink.\n",
    "pf02_in_002.wav": "Find a door with posters in front of the yellow pillar, then go stand by the tree but avoid any sofa.\n",
    "pf02_in_003.wav": "There is a cabinet, a television and a tree in this room. I want you to go to the last item I mentioned, then pass by the second item, but don't go close to the first item when you are going to the second item.\n",
    "pf02_in_017.wav": "you can either go as close as you can to the sink or the plant pots but don't go near the yellow robots\n",
    "pm05_in_010.wav": "I need you to first go to the table between the pillar and the door with posters, then go to the tree. You know what? Ignore the last thing I asked you to go to. After the first thing, go to the computer next to the green box instead.\n",
    "pm05_in_004.wav": "Go to the trash bin. After that, go to the large television. Actually, can you go to the laptop on the table before doing all that?\n",
    "pf01_in_019.wav": "Go to the sink, then the red sofa, then the guitar. After that, I want you to return to the first thing you visited.\n",
    "pf01_in_025.wav": "Bring the green plush toy to the white board in front of it. Watch out for the robot in front of the toy.\n",
    "pf01_in_031.wav": "Hey, I am standing by the white board in front of the bookshelf. Can you bring me the mug from the table to the left of the fridge?\n",
    "pm03_in_033.wav": "Take a soda can to the fridge, you can find one on the table to the left of the blue sofa.\n",
    "pm03_in_027.wav": "Find the bottle that is on the table to the left of the computer and bring it to the wardrobe that is next to the glass door.\n",
    "pf04_in_008.wav": "Go to any trash bin, but not the yellow one.\n",
    "pf04_in_020.wav": "I need you to go to the sink, then any computer on a table, but before you do that, can you go to the bookshelf? When you are done with all that, return to brown books.\n",
    "pf04_in_034.wav": "Hey, can you pick up my bag for me? It's under the table in front of the glass door, bring it to the cabinet. Actually, you know what? Forget what I asked for and bring the green toy instead. It's at the same place.\n",
    "pf04_in_011.wav": "Go to the red sofa, then the blue one next to the cabinet, but first pass by the bookshelf.\n",
    "pf04_in_005.wav": "try to go to the tree without going near the trash bin\n",
    "pm03_in_002.wav": "Find the door with the posters in front of the yellow pillar, then go stand by the tree but avoid any sofa.\n",
    "pm03_in_016.wav": "I need you to go to the end of the red sofa, but don't go anywhere near the sink\n",
    "pf01_in_028.wav": "Go to the cabinet between the blue sofa and the yellow robot or the cabinet to the left of the blue sofa.\n",
    "pf01_in_014.wav": "Go to the cabinet between the blue sofa and the brown box.\n",
    "pm05_in_009.wav": "Visit one of the televisions in this room, then go to the fridge to the left of the cabinet.\n",
    "pm05_in_021.wav": "There are a couple of things in this room. A coffee machine, a robot, a computer, and a plant pot. Visit the second item I mentioned, then the first. After that, visit the brown box. Then go to the items you haven't visited yet.\n",
    "pm05_in_035.wav": "Go to the sink and take the mug beside the coffee maker. Drop it off at the red sofa.\n",
    "pf02_in_032.wav": "Never pass by a robot, but I need you to bring the bag on the table to the cabinet.\n",
    "pf02_in_026.wav": "Go get my yellow bag and bring it to the table between the yellow pillar and the wooden door with posters next to the white board.\n",
    "pf02_in_027.wav": "Find the bottle that is on the table to the left of the computer and bring it to the wardrobe that is next to the glass door.\n",
    "pf02_in_033.wav": "Take a soda can to the fridge. You can find one on the table to the left of the blue sofa.\n",
    "pm05_in_034.wav": "Hey, can you pick up my bag for me? It is under the table in front of the glass door. Bring it to the cabinet. Actually, you know what? Forget what I asked for and bring the green toy instead. It's at the same place.\n",
    "pm05_in_020.wav": "I need you to go to the sink, then any computer on the table. But before you start that, can you first go to the bookshelf? When you are done with all that, return to brown box.\n",
    "pm05_in_008.wav": "Go to any trash bin but not the yellow one.\n",
    "pf01_in_001.wav": "Go to the red sofa but don't pass by any door then go to the computer. The sofa is behind the pillar and on the right side.\n",
    "pf01_in_015.wav": "I want you to go to the cabinet, but don't go near any black chair. Hold on. Actually, can you pass by the white board before doing all that?\n",
    "pf01_in_029.wav": "Go take the green toy that is next to the sofa under the poster and bring it to the bookshelf\n",
    "pm03_in_017.wav": "You can either go as close as you can to the sink or the plant pot but don't go near the yellow robot.\n",
    "pm03_in_003.wav": "There is a cabinet, a television and a tree in this room. I want you to go to the last item I mentioned, then pass by the second item but don't go close to the first when you are going to the second item.\n",
    "pf04_in_004.wav": "Go to the trash bin. After that, go to the large television. Actually, can you go to the laptop on the table before doing all that?\n",
    "pf04_in_010.wav": "I need you to first go to the table between the pillar and the door with posters, then go to the tree. You know what? Ignore the last thing I asked you to go to. After the first thing, go to the computer next to the green box instead.\n",
    "pf04_in_006.wav": "Find the yellow trash bin and go to it. Then go by the white table, but before doing the first thing, visit where the fridge is. Then after the last thing, stop by the red sofa, but avoid the wooden door with posters.\n",
    "pf04_in_012.wav": "Go to the water filter but don't pass by any computer to the left of the red sofa.\n",
    "pm03_in_015.wav": "I want you to go to the cabinet, but don't go near any black chair. Hold on. Actually, can you pass by the white board before doing all that?\n",
    "pm03_in_001.wav": "Go to the red sofa but don't pass by any door. Then go to the computer. The sofa is behind the pillar and on the right side.\n",
    "pm03_in_029.wav": "Go take the green toy that is next to the sofa under the poster and bring it to the bookshelf.\n",
    "pf01_in_003.wav": "There is a cabinet, a television, and a tree in this room. I want you to go to the last item I mentioned, then pass by the second item, but don't go close to the first when you are going to the second item.\n",
    "pf01_in_017.wav": "You can either go as close as you can to the sink or the plant pots but don't go near the yellow rowboats.\n",
    "pm05_in_022.wav": "Avoid any cabinets, but go get the mug on the blue sofa and take it to the red one.\n",
    "pf02_in_025.wav": "Bring the green plush toy to the white board in front of it. Watch out for the robot in front of the toy.\n",
    "pf02_in_031.wav": "Hey, I am standing by the white board in front of the bookshelf. Can you bring me the mug from the table to the left of the fridge?\n",
    "pf02_in_019.wav": "Go to the sink, then the red sofa, then the guitar. After that, I want you to return to the first thing you visited.\n",
    "pf02_in_018.wav": "Go to the green curtain. After that the large television but try not to go near the red sofa.\n",
    "pf02_in_030.wav": "I have a white cabinet, a green toy, a bookshelf, and a red chair around here somewhere. Take that second item I mentioned from between the first item and the third. Bring it to the cabinet, but avoid the last item at all costs.\n",
    "pf02_in_024.wav": "Can you pick up my book from the left side of the television and bring it to me? I am sitting on the couch, which is to the right of a door with posters. Make sure to never go near the trash bin while doing all this. It is on the yellow table.\n",
    "pm05_in_023.wav": "Please get me my plant pot from between the sofa and the sink. Bring it to the white cabinet.\n",
    "pf01_in_016.wav": "I need you to go to the red sofa but don't go anywhere near the sink.\n",
    "pf01_in_002.wav": "Find the door with posters in front of the yellow pillar then go stand by the tree but avoid any sofa.\n",
    "pm03_in_028.wav": "Go to the cabinet between the blue sofa and the yellow robot or the cabinet to the left of the blue sofa.\n",
    "pm03_in_014.wav": "Go to the cabinet between the blue sofa and the brown box.\n",
    "pf04_in_013.wav": "Visit these things in the following order, the microwave, then the black chair in front of the yellow robot, then the fridge, but before doing any of this, go to the robot.\n",
    "pf04_in_007.wav": "Go to the television but avoid the tree.\n",
    "pf04_in_003.wav": "There is a cabinet, a television and a tree in this room. I want you to go to the last item I mentioned, then pass by the second item. But don't go close to the first when you are going to the second item.\n",
    "pf04_in_017.wav": "You can either go as close as you can to the sink or the plant's pot, but don't go near the yellow robot.\n",
    "pm03_in_010.wav": "I need you to first go to the table between the pillar and the door with the posters then go to the tree You know what? Ignore the last thing I asked you to go to. After the first thing go to the computer next to the green box instead\n",
    "pm03_in_004.wav": "Go to the trash bin. After that, go to the large television. Actually, can you go to the laptop on the table before doing all that?\n",
    "pf01_in_006.wav": "Find the yellow trash bin and go to it then go by the white table but before doing the first thing visit where the fridge is then after the last thing stop by the red sofa but avoid the wooden door with posters\n",
    "pf01_in_012.wav": "Go to water filter. Don't pass by any computer to the left of the red sofa.\n",
    "pm05_in_033.wav": "Take a soda can to the fridge. You can find one on the table to the left of the blue sofa.\n",
    "pm05_in_027.wav": "Find the bottle that is on the table to the left of the computer and bring it to the wardrobe that is next to the glass door.\n",
    "pf02_in_008.wav": "Go to any trash bin, but not the yellow one.\n",
    "pf02_in_020.wav": "I need you to go to the sink, then any computer on the table. But before you start that, can you first go to the bookshelf? When you are done with all that, return to the brown box.\n",
    "pf02_in_034.wav": "Hey, can you pick up my bag for me? It is under the table in front of a glass door. Bring it to the cabinet. Actually, you know what? Forget what I asked for and bring the green toy instead. It's in the same place.\n",
    "pf02_in_035.wav": "Go to the sink and take the mug beside the coffee maker drop it off at the red sofa\n",
    "pf02_in_021.wav": "There are a couple of things in this room, a coffee machine, a robot, a computer and a plant pot. Visit the second item I mentioned, then the first, after that visit the brown box, then go to the items you haven't visited yet.\n",
    "pf02_in_009.wav": "Visit one of the televisions in this room, then go to the fridge to the left of the cabinet.\n",
    "pm05_in_026.wav": "Go get my yellow bag and bring it to the table between the yellow pillar and the wooden door with posters next to the whiteboard.\n",
    "pm05_in_032.wav": "Never pass by a robot, but I need you to bring the bag on the table to the cabinet.\n",
    "pf01_in_013.wav": "Visit these things in the following order. The microwave, then the black chair in front of the yellow robot, then the fridge. But before doing any of this, go to the robot.\n",
    "pf01_in_007.wav": "Go to the television but avoid the tree\n",
    "pm03_in_005.wav": "Try to go to the tree without going near the trash bin.\n",
    "pm03_in_011.wav": "Go to the red sofa, then the blue one next to the cabinet, but first pass by the bookshelf.\n",
    "pf04_in_016.wav": "I need you to go to the red sofa but don't go anywhere near the sink.\n",
    "pf04_in_002.wav": "Find the door with posters in front of the yellow pillar, then go stand by the tree but avoid any sofa.\n",
    "pf04_in_014.wav": "Go to the covenants between the blue sofa and the brown box.\n",
    "pf04_in_028.wav": "Go to the cabinets between the blue sofa and the yellow robot or the cabinet to the left of the blue sofa.\n",
    "pm03_in_007.wav": "Go to the television but avoid the tree.\n",
    "pm03_in_013.wav": "Visit these things in the following order, the microwave, then the black chair in front of the yellow robot, then the fridge, but before doing any of this, go to the robot.\n",
    "pf01_in_011.wav": "Go to the red sofa, then the blue one next to the cabinet but first pass by the bookshelf.\n",
    "pf01_in_005.wav": "Try to go to the tree without going near the trash bin.\n",
    "pm05_in_024.wav": "Can you pick up my book from the left side of the television and bring it to me? I am sitting on the couch which is to the right of the door with posters. Make sure to never go near the trash bin while doing all this. It is on the yellow table.\n",
    "pm05_in_030.wav": "I have a white cabinet, a green toy, a bookshelf and a red chair around here somewhere. Take the second item I mentioned from between the first item and the third. Bring it to the cabinet, but avoid the last item at all costs.\n",
    "pm05_in_018.wav": "Go to the green curtain after that the large television but try not to go near the red sofa\n",
    "pf02_in_023.wav": "Please get me my plant pot from between the sofa and the sink. Bring it to the white cabinets.\n",
    "pf02_in_022.wav": "Avoid any cabinets but go get the mug on the blue sofa and take it to the red one.\n",
    "pm05_in_019.wav": "Go to the sink, then the red sofa, then the guitar. After that I want you to return to the first thing you visited.\n",
    "pm05_in_031.wav": "Hey, I am standing by the whiteboard in front of the bookshelf, can you bring me the mug from the table to the left of the fridge?\n",
    "pm05_in_025.wav": "Bring the green plush toy to the white board in front of it. Watch out for the robot in front of the toy.\n",
    "pf01_in_004.wav": "Go to the trash bin. After that, go to the large television. Actually, can you go to the laptop on the table before doing all that?\n",
    "pf01_in_010.wav": "I need you to first go to the table between the pillar and the door with posters, then go to the tree. You know what, ignore the last thing I asked you to go to. After the first thing, go to the computer next to the green box instead.\n",
    "pm03_in_012.wav": "Go to the water filter, don't pass by any computer to the left of the red sofa.\n",
    "pm03_in_006.wav": "Find the yellow trash bin and go to it, then go by the white table but before doing the first thing, visit where the fridge is, then after the last thing, stop by the red sofa but avoid the wooden door with posters.\n",
    "pf04_in_029.wav": "Go take the green toy that is next to the sofa under the poster and bring it to the bookshelf.\n",
    "pf04_in_001.wav": "Go to the red sofa but don't pass by any door. Then go to the computer. The sofa is behind the pillar and on the right side.\n",
    "pf04_in_015.wav": "I want you to go to the cabinet, but don't go near any black chair. Hold on. Actually, can you pass by the white board before doing all that?\n",
    "pm04_in_006.wav": "Find the yellow trash bin and go to it. Then go by the white table. But before doing the first thing, visit where the fridge is. Then after the last thing, stop by the red sofa but avoid the wooden door with posters.\n",
    "pm04_in_012.wav": "Go to water filter, don't pass by any computer to the left of the red sofa.\n",
    "pf03_in_029.wav": "go take the green toy that is next to the sofa under the poster and bring it to the bookshelf\n",
    "pf03_in_015.wav": "I want you to go to the cabinet but don't go near any black chair. Hold on. Actually, can you pass by the whiteboard before doing all that?\n",
    "pf03_in_001.wav": "Go to the red sofa but don't pass by any door. Then go to the computer. The sofa is behind the pillar and on the right side.\n",
    "pm01_in_003.wav": "There's a cabinet, a television and a tree in this room. I want you to go to the last item I mentioned, then pass by the second item but don't go close to the first when you are going to the second item.\n",
    "pm01_in_017.wav": "You can either go as close as you can to the sink or the plant pot but don't go near the yellow robot.\n",
    "pf05_in_022.wav": "avoid any cabinets but go get the mug on the blue sofa and take it to the red one\n",
    "pm02_in_019.wav": "Go to the sink, then the red sofa, then the guitar. After that, I want you to return to the first thing you visited.\n",
    "pm02_in_025.wav": "Bring the green plush toy to the white board in front of it. Watch out for the robots in front of the toy.\n",
    "pm02_in_031.wav": "Hey, I am standing by the whiteboard in front of the bookshelf. Can you bring me the mug from the table to the left of the fridge?\n",
    "pm02_in_030.wav": "I have a white cabinet, a green toy, a bookshelf and a red chair around here somewhere. Take the second item I mentioned from between the first item and the third. Bring it to the cabinet but avoid the last item at all costs.\n",
    "pm02_in_024.wav": "Can you pick up my book from the left side of the television and bring it to me? I am sitting on the couch which is to the right of the door with posters. Make sure to never go near the trash bin while doing all this. It's on the yellow table.\n",
    "pm02_in_018.wav": "Go to the green curtain after the large elevation but try not to go near the red sofa.\n",
    "pf05_in_023.wav": "please get me my plant pot from between the sofa and the sink bring it to the white cabinet\n",
    "pm01_in_016.wav": "I need you to go to the red sofa but don't go anywhere near the sink.\n",
    "pm01_in_002.wav": "Find the door with posters in front of the yellow pillar, then go stand by the tree but avoid any sofa.\n",
    "pf03_in_014.wav": "Go to the cabinet between the blue sofa and the brown box.\n",
    "pf03_in_028.wav": "Go to the cabinet between the blue sofa and the yellow robot or the cabinet to the left of the blue sofa.\n",
    "pm04_in_013.wav": "Visit these things in the following order, the microwave, then the black chair in front of the yellow robot, then the fridge. But before doing any of this, go to the robot.\n",
    "pm04_in_007.wav": "Go to the television but avoid the tree.\n",
    "pm04_in_011.wav": "Go to the red sofa, then the blue one next to the cabinet, but first pass by the bookshelf.\n",
    "pm04_in_005.wav": "Try to go to the tree without going near the trash bin.\n",
    "pf03_in_002.wav": "Find the door with posters in front of the yellow pillar, then go stand by the tree but avoid any sofa.\n",
    "pf03_in_016.wav": "I need you to go to the red sofa but don't go anywhere near the sink.\n",
    "pm01_in_014.wav": "Go to the cabinet between the blue sofa and the brown box.\n",
    "pm01_in_028.wav": "Go to the cabinet between the blue sofa and the yellow robot or the cabinet to the left of the blue sofa.\n",
    "pf05_in_021.wav": "There are a couple of things in this room. A coffee machine, a robot, a computer, and a plant pot. Visit the second item I mentioned, then the first. After that, visit the brown box, then go to the items you haven't visited yet.\n",
    "pf05_in_035.wav": "Go to the sink and take the mug beside the coffee maker, drop it off at the red sofa.\n",
    "pf05_in_009.wav": "Visit one of the televisions in this room, then go to the fridge to the left of the cabinet.\n",
    "pm02_in_032.wav": "Never pass by a robot, but I need you to bring the bag on the table to the cabinet.\n",
    "pm02_in_026.wav": "Go get my yellow bag and bring it to the table between the yellow pillar and the wooden door with posters next to the whiteboard.\n",
    "pm02_in_027.wav": "Find the bottle that is on the table to the left of the computer and bring it to the wardrobe that is next to the glass door.\n",
    "pm02_in_033.wav": "Take a soda can to the fridge, you can find one on the table to the left of the blue sofa.\n",
    "pf05_in_008.wav": "Go to any trash bin, but not the yellow one.\n",
    "pf05_in_034.wav": "Hey, can you pick up my bag for me? It is under the table in front of the glass door. Bring it to the cabinet. Actually, you know what? Forget what I asked for and bring the green toy instead. It's at the same place.\n",
    "pf05_in_020.wav": "I need you to go to the sink, then any computer on the table, but before you start that, can you first go to the bookshelf? When you are done with all that, return to brown box.\n",
    "pm01_in_029.wav": "Go take the green toy that is next to the sofa under the poster and bring it to the bookshelf.\n",
    "pm01_in_001.wav": "Go to the red sofa but don't pass by any door, then go to the computer. The sofa is behind the pillar and on the right side.\n",
    "pm01_in_015.wav": "I want you to go to the cabinet but don't go near any black chain, hold on, actually can you pass by the whiteboard before doing all that.\n",
    "pf03_in_017.wav": "You can either go as close as you can to the sink or the plant pot but don't go near the yellow robot.\n",
    "pf03_in_003.wav": "There is a cabinet, a television and a tree in this room. I want you to go to the last item I mentioned, then pass by the second item but don't go close to the first when you are going to the second item.\n",
    "pm04_in_004.wav": "Go to the trash bin. After that, go to the large television. Actually, can you go to the laptop on the table before doing all that?\n",
    "pm04_in_010.wav": "I need you to first go to the table between the pillar and the door with the posters. Then go to the tree. You know what? Ignore the last thing I asked you to go to. After the first thing, go to the computer next to the green box instead.\n",
    "pm04_in_028.wav": "Go to the cabinets between the blue sofa and the yellow robot or the cabinet to the left of the blue sofa.\n",
    "pm04_in_014.wav": "Go to the cabinets between the blue sofa and the brown box.\n",
    "pf03_in_007.wav": "Go to the television but avoid the tree.\n",
    "pf03_in_013.wav": "Visit these things in the following order, the microwave, then the black chair in front of the yellow robot, then the fridge. But before doing any of this, go to the robot.\n",
    "pm01_in_011.wav": "Go to the red sofa then the blue one next to the cabinet but first pass by the bookshelf.\n",
    "pm01_in_005.wav": "Try to go to the tree without going near the trash bin\n",
    "pf05_in_018.wav": "Go to the green curtain, after that the large television but try not to go near the red sofa.\n",
    "pf05_in_024.wav": "Can you pick up my book from the left side of the television and bring it to me? I'm sitting on the couch which is to the right of the drawer with the post-its. Make sure to never go near the trash bin while doing all this. It's on the yellow table.\n",
    "pf05_in_030.wav": "I have a white cabinet, a green toy, a bookshelf, and a red chair around here somewhere. Take the second item I mentioned from between the first item and the third. Bring it to the cabinet but avoid the last item at all costs.\n",
    "pm02_in_023.wav": "Please get me my plant pot from between the sofa and the sink. Bring it to the white cabinet.\n",
    "pm02_in_022.wav": "Avoid any cabinets but go get the mug on the blue sofa and take it to the red one.\n",
    "pf05_in_031.wav": "Hey, I'm standing by the whiteboard in front of the bookshelf. Can you bring me the mug from the table to the left of the fridge?\n",
    "pf05_in_025.wav": "Bring the green plush toy to the white board in front of it. Watch out for the robot in front of the toy.\n",
    "pf05_in_019.wav": "Go to the sink, then the red sofa, then the guitar. After that, I want you to return to the first thing you visited.\n",
    "pm01_in_004.wav": "Go to the trash bin. After that go to the large television. Actually, can you go to the laptop on the table before doing all that?\n",
    "pm01_in_010.wav": "I need you to go to the table between the pillar and the door with posters, then go to the chair. You know what? Ignore the last thing I asked you to go to. After the first thing, go to the computer next to the green box.\n",
    "pf03_in_012.wav": "Go to water filter, don't pass by any computer to the left of the red sofa.\n",
    "pf03_in_006.wav": "Find the yellow trash bin and go to it. Then go by the white table. But before doing the first thing, visit where the fridge is. Then after the last thing, stop by the red sofa but avoid the wooden door with posters.\n",
    "pm04_in_001.wav": "Go to the red sofa but don't pass by any door. Then go to the computer. The sofa is behind the pillar and on the right side.\n",
    "pm04_in_015.wav": "I want you to go to the cabinet, but don't go near any black chair. Hold on. Actually, can you pass by the white board before doing all that?\n",
    "pm04_in_029.wav": "Go take the green toy that is next to the sofa under the poster and bring it to the bookshelf.\n",
    "pm04_in_003.wav": "There is a cabinet, a television and a tree in this room. I want you to go to the last item I mentioned, then pass by the second item, but don't go close to the first when you are going to the second item.\n",
    "pm04_in_017.wav": "You can either go as close as you can to the sink or the plant's pot, but don't go near the yellow robot.\n",
    "pf03_in_010.wav": "I need you to first go to the table between the pillar and the doorway posters, then go to the tree. You know what? Ignore the last thing I asked you to go to. After the first thing, go to the computer next to the green box instead.\n",
    "pf03_in_004.wav": "Go to the trash bin. After that, go to the large television. Actually, can you go to the laptop on the table before doing all that?\n",
    "pm01_in_006.wav": "Find the yellow trash bin and go to it, then go by the white table, but before doing the first thing, visit where the fridge is, then after the last thing, stop by the red sofa but avoid the wooden door with posters.\n",
    "pm01_in_012.wav": "Go to the water filter. Don't pass by any computer to the left of the red sofa\n",
    "pf05_in_033.wav": "Take a soda can to the fridge you can find one on the table to the left of the blue sofa\n",
    "pf05_in_027.wav": "Find the bottle that is on the table to the left of the computer and bring it to the wardrobe that is next to the glass door.\n",
    "pm02_in_020.wav": "I need you to go to the sink, then any computer on the table, but before you start that, can you first go to the bookshelf? When you are done with all that, return to the brown box.\n",
    "pm02_in_034.wav": "Hey, can you pick up my bag for me? It is under the table in front of the glass door, bring it to the cabinet. Actually, you know what, forget what I asked for and bring the green toy instead, it's at the same place.\n",
    "pm02_in_008.wav": "Go to any trash bin but not the yellow one.\n",
    "pm02_in_009.wav": "Visit one of the televisions in this room, then go to the fridge to the left of the cabinet.\n",
    "pm02_in_035.wav": "Go to the sink and take the mug beside the coffee maker. Drop it off at the red sofa.\n",
    "pm02_in_021.wav": "There are a couple of things in this room, a coffee machine, a robot, a computer and a plant pot. Visit the second item I mentioned, then the first. After that, visit the brown box, then go to the items you haven't visited yet.\n",
    "pf05_in_026.wav": "Go get my yellow bag and bring it to the table between the yellow pillar and the wooden door with posters next to the white board.\n",
    "pf05_in_032.wav": "Never pass by a robot, but I need you to bring the bag on the table to the cabinet.\n",
    "pm01_in_013.wav": "Visit these things in the following order, the microwave, then the black chair in front of the yellow robot, then the fridge, but before doing any of this, go to the robot.\n",
    "pm01_in_007.wav": "Go to the television, but avoid the tree.\n",
    "pf03_in_005.wav": "Try to go to the tree without going near the trash bin.\n",
    "pf03_in_011.wav": "Go to the red sofa, then the blue one next to the cabinet, but first pass by the bookshelf.\n",
    "pm04_in_016.wav": "I need you to go to the red sofa but don't go anywhere near the sink.\n",
    "pm04_in_002.wav": "Find the door with posters in front of the yellow pillow, then go stand by the tree and avoid any sofa.\n"
}