{
    "g_1.m4a": "Place the rag in the basket beside the fridge.\n",
    "g_2.m4a": "Place the rag in the basket beside the fridge.\n",
    "g_3.m4a": "Move the box beside the table to the right of the chair.\n",
    "g_4.m4a": "Move the bottom side of the table to the right of the chair.\n",
    "g_5.m4a": "Pick up the book on the table with the red cover.\n",
    "g_6.m4a": "Pick up the book on the table with the red cover.\n",
    "g_7.m4a": "Go to the painting of the dog and the cat\n",
    "g_8.m4a": "Go to the painting of the dog and the cat.\n",
    "g_9.m4a": "Place the wreath on the table in the corner.\n",
    "g_10.m4a": "Place the vase on the table in the corner.\n",
    "g_11.m4a": "Bring the lamp from the bedroom upstairs\n",
    "g_12.m4a": "Bring the lamp from the bedroom upstairs.\n",
    "g_13.m4a": "Put the cup on the table by the couch.\n",
    "g_14.m4a": "Put the cup on the table by the couch.\n",
    "g_15.m4a": "Bring me the book and the newspaper on the chair.\n",
    "g_16.m4a": "Bring me the book and the newspaper on the chair.\n",
    "g_17.m4a": "Pick up the mug on the coaster near the sink.\n",
    "g_18.m4a": "Pick up the mug on the coaster near the sink.\n",
    "g_19.m4a": "Bring me the pillow and the blankets on the chair\n",
    "g_20.m4a": "Bring me their pillow and their blankets from the chair.\n",
    "g_21.m4a": "Move the table in the kitchen beside the refrigerator.\n",
    "g_22.m4a": "Move the table in the kitchen beside the refrigerator.\n",
    "g_23.m4a": "Place the basket with the fruits on the counter.\n",
    "g_24.m4a": "Place the baskets with the fruit on the counter.\n",
    "g_25.m4a": "Bring the book and the marks in on the 9th stand.\n",
    "g_26.m4a": "Bring the book and the marks in on the 9th stand.\n",
    "g_27.m4a": "Place the vase near the flowers on the tea wall.\n",
    "g_28.m4a": "Place the vase near the flowers on the table.\n",
    "g_29.m4a": "Send the bottle behind the sofa to the television.\n",
    "g_30.m4a": "Send the bottle behind the sofa to the television.\n",
    "g_31.m4a": "Move the wire through the hoop to the socket.\n",
    "g_32.m4a": "Move the wire through the hole to the socket.\n",
    "g_33.m4a": "Place the Coke can beside the Pringles on the counter.\n",
    "g_34.m4a": "Place the cook can beside the Pringles on the counter.\n",
    "g_35.m4a": "Move the coffee machine above the shelf to the right.\n",
    "g_36.m4a": "Move the coffee machine above the shelf to the right.\n",
    "g_37.m4a": "Push the cut between the corners to the dough.\n",
    "g_38.m4a": "Push the cut between the scanners to the dough.\n",
    "g_39.m4a": "Place the camera below the drone, near the ports.\n",
    "g_40.m4a": "Place the camera below the drone near the ports.\n",
    "g_41.m4a": "Move the kettle over the sink to the fridge.\n",
    "g_42.m4a": "Move the kettle over the sink to the fridge.\n",
    "g_43.m4a": "Drive the vehicle around the pits, carefully to the station.\n",
    "g_44.m4a": "Drive the vehicle around the pits carefully to the station.\n",
    "g_45.m4a": "Move the chair behind the covenants, carefully.\n",
    "g_46.m4a": "Move the chair behind the cabinet carefully.\n",
    "g_47.m4a": "Send the drone over the green box to the lamp post.\n",
    "g_48.m4a": "Send the drone over the green box to the lamp post.\n",
    "g_49.m4a": "Transport the equipment below the platform to the site.\n",
    "g_50.m4a": "Transport the equipment below the platform to the site.\n",
    "g_51.m4a": "Guide the vehicle under the bridge to the depot.\n",
    "g_52.m4a": "Guide the vehicle under the bridge to the depot.\n",
    "g_53.m4a": "Place the sandwich near the drink on the table.\n",
    "g_54.m4a": "Place the sandwich near the drink on the table.\n",
    "g_55.m4a": "Place the jar on the shelf near the door.\n",
    "g_56.m4a": "place the jar on the shelf near the door\n",
    "g_57.m4a": "Put the keys under the book on the table.\n",
    "g_58.m4a": "Put the keys under the book on the table.\n",
    "g_59.m4a": "Move the chair beside the sofa, close to the window.\n",
    "g_60.m4a": "Move the chair beside the sofa close to the window.\n",
    "g_61.m4a": "Place the lamp on the nightstand by the bed.\n",
    "g_62.m4a": "Place the lamp on the nightstand by the bed.\n",
    "g_63.m4a": "Bring the mug from the table near the sink.\n",
    "g_64.m4a": "Bring the mug from the table near the sink.\n",
    "g_65.m4a": "Hang the painting above the couch near the window.\n",
    "g_66.m4a": "Hang the painting above the couch near the window.\n",
    "g_67.m4a": "Move the book under the lamp near the shelf.\n",
    "g_68.m4a": "Move the book under the lamp near the shelf.\n",
    "g_69.m4a": "Push the sofa behind the table to the wall.\n",
    "g_70.m4a": "push the sofa behind the table to the wall\n"
}